app/controllers/movies_controller.rb

        redirect_to params.merge(:sort_by => session[:sort_by])
    end

    @movies = Movie.find_all_by_rating(@ratings_array, :order => session[:sort_by])
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "rating" = 'PG', "updated_at" = '2015-03-24 23:18:28.453479' WHERE "movies"."id" = 1